Repository: krupnfs/GRBL-Plotter
Catalog: GRBL-Plotter/Resources/ResStrings.*.resx
Languages: ar, cs, it, pt, tr, zh_cn

# grblAlarm
source: Alarm
ar: إنذار
cs: Poplach
it: Allarme
pt: Alarme
zh_cn: 报警

# grblCheck
source: Check
ar: التحقق من
cs: Šek
it: Dai un'occhiata
pt: Verifica
tr: Kontrol etmek
zh_cn: 校验

# grblDoor
source: Door
ar: باب
cs: Dveře
it: Porta
pt: Porta
tr: Kapı
zh_cn: 门

# grblHold
source: Hold
ar: معلق
cs: Držet
it: Blocca
pt: Aguarde
tr: Tutmak
zh_cn: 保持

# grblHome
source: Home
ar: الصفحة الرئيسية
cs: Domov
it: Casa
pt: Casa
tr: Ev
zh_cn: 家

# grblIdle
source: Idle
ar: خامل
cs: Líný
it: Pausa
pt: Ocioso
tr: Boşta
zh_cn: 闲

# grblJog
source: Jog
ar: يجري بيطء
it: Fare jogging
tr: Koşu
zh_cn: 慢跑

# grblProbe
source: Probe
ar: مسبار
cs: Sonda
it: Sondare
pt: Sonda
tr: İncelemek, bulmak
zh_cn: 探测

# grblRun
source: Run
ar: يركض
cs: Běh
it: Partire
pt: Ecexutando
tr: Koşmak
zh_cn: 跑

# grblSleep
source: Sleep
ar: ينام
cs: Spát
it: Fermo
pt: Dormir
tr: Uyumak
zh_cn: 睡觉

# grblNotConnected
source: grbl controller is not connected!\r\nCannot perform the desired action!
ar: جهاز تحكم grbl غير متصل! \r\n لا يمكن تنفيذ الإجراء المطلوب!
cs: Ovladač grbl není připojen!\r\nNelze provést požadovanou akci!
it: Il controller grbl non è connesso!\r\nImpossibile eseguire l'azione desiderata!
pt: controlador grbl não está conectado! \r\nNão é possível realizar a ação desejada!
tr: grbl denetleyicisi bağlı değil!\r\nİstenen eylem gerçekleştirilemiyor!
zh_cn: grbl 控制器未连接！\r\n无法执行所需的操作！

# mainAttention
source: Attention
ar: انتباه
cs: Pozornost
it: Attenzione
pt: Atenção
tr: Dikkat
zh_cn: 注意

# mainHelpLanguage
source: Feel free to improove translation
ar: لا تتردد في تحسين الترجمة
cs: Klidně překlad vylepšete
it: Sentiti libero di migliorare la traduzione
pt: Sinta-se livre para melhorar a tradução
tr: Çeviriyi geliştirmekten çekinmeyin
zh_cn: 随时改善翻译

# mainHotkeyError
source: File 'hotkeys.xml' not found, no hotkeys set!
ar: لم يتم العثور على الملف "hotkeys.xml" ، ولم يتم تعيين مفاتيح الاختصار!
cs: Soubor 'hotkeys.xml' nebyl nalezen, nejsou nastaveny žádné klávesové zkratky!
it: File 'hotkeys.xml' non trovato, nessun tasto di scelta rapida impostato!
pt: Arquivo 'hotkeys.xml' não encontrado, nenhuma tecla de atalho definida!
tr: 'hotkeys.xml' dosyası bulunamadı, kısayol tuşu ayarlanmadı!
zh_cn: 找不到文件“ hotkeys.xml”，未设置任何热键！

# mainHotkeyError1
source: Unknown action:
ar: عمل غير معروف:
cs: Neznámá akce:
it: Azione sconosciuta:
pt: Ação desconhecida:
tr: Bilinmeyen eylem:
zh_cn: 未知动作：

# mainHotkeyError2
source: Error with Hotkey.xml
ar: خطأ في Hotkey.xml
cs: Chyba s Hotkey.xml
it: Errore con Hotkey.xml
pt: Erro com o Hotkey.xml
tr: Hotkey.xml hatası
zh_cn: Hotkey.xml错误

# mainInfoCheckCode
source: Check G-Code
ar: تحقق G- كود
cs: Zkontrolujte G-kód
it: Controlla il codice G
pt: Verificar código G
tr: G Kodunu Kontrol Edin
zh_cn: 检查G码

# mainInfoErrorLine
source: Error before line
ar: خطأ قبل الخط
cs: Chyba před řádkem
it: Errore prima della riga
pt: Erro antes da linha
tr: Satırdan önce hata
zh_cn: 行前错误

# mainInfoFinishCheck
source: Finish checking G-Code
ar: إنهاء التحقق من رمز G-
cs: Dokončete kontrolu G-kódu
it: Finisci di controllare il codice G
pt: Concluir a verificação do código G
tr: G-Code'u kontrol etmeyi bitirin
zh_cn: 完成检查G代码

# mainInfoFinishSend
source: Finish sending G-Code
ar: الانتهاء من إرسال G- كود
cs: Dokončete odesílání G-kódu
it: Termina l'invio del codice G
pt: Concluir o envio do código G
tr: G Kodu göndermeyi bitir
zh_cn: 完成发送G代码

# mainInfoKill
source: Press 'Kill Alarm' to proceed ('$X')
ar: اضغط على "Kill Alarm" للمتابعة
cs: Pokračujte stisknutím 'Kill Alarm' ('$X')
it: Premi 'Kill Alarm' per procedere ('$X')
pt: Pressione 'Kill Alarm' para prosseguir
tr: Devam etmek için 'Alarmı Sonlandır'a basın ('$X')
zh_cn: 按“杀死警报”继续

# mainInfoLaserModeOff
source: Laser Mode not active $32=0
ar: وضع الليزر غير نشط $ 32 = 0
cs: Laserový režim není aktivní $32=0
it: Modalità laser non attiva $32=0
pt: Modo Laser não ativo $ 32 = 0
tr: Lazer Modu etkin değil $32=0
zh_cn: 激光模式无效$32 = 0

# mainInfoLaserModeOn
source: Laser Mode active $32=1
ar: وضع الليزر النشط 32 دولار = 1
cs: Aktivní laserový režim $32=1
it: Modalità laser attiva $32=1
pt: Modo a laser ativo $ 32 = 1
tr: Lazer Modu etkin $32=1
zh_cn: 启用激光模式$32 = 1

# mainInfoPause
source: Pause streaming - press play (
ar: توقف مؤقتًا - اضغط على play (
cs: Pozastavit streamování - stiskněte tlačítko přehrávání (
it: Metti in pausa lo streaming: premi play (
pt: Pausar streaming - pressione reproduzir (
tr: Akışı duraklatın - oynat düğmesine basın (
zh_cn: 暂停流媒体-按播放（

# mainInfoProbing
source: Probing
ar: جس
cs: Sondování
it: Sondaggio
pt: Sondagem
tr: Sondaj
zh_cn: 探测

# mainInfoResume
source: Press 'Resume' to proceed
ar: اضغط على "استئناف" للمتابعة
cs: Pokračujte stisknutím tlačítka Obnovit
it: Premi 'Riprendi' per procedere
pt: Pressione 'Continuar' para continuar
tr: Devam etmek için 'Devam Et'e basın
zh_cn: 按“继续”继续

# mainInfoSendCode
source: Send G-Code
ar: إرسال رمز G
cs: Odeslat G-Code
it: Invia codice G
pt: Enviar código G
tr: G Kodu Gönder
zh_cn: 发送G码

# mainInfoStopStream
source: STOP streaming (
ar: إيقاف البث (
cs: ZASTAVIT streamování (
it: INTERROMPI lo streaming (
pt: PARAR a transmissão (
tr: Akışı DURDUR (
zh_cn: 停止流式传输（

# mainInfoStopStream2
source: STOP streaming ( Line
ar: وقف التدفق (الخط
cs: ZASTAVIT streamování ( řádek
it: STOP streaming (Linea
pt: PARAR a transmissão (Linha
tr: Akışı DURDUR ( Hat
zh_cn: 停止流式传输（行

# mainInfoToolChange
source: Tool change...
ar: تغيير الأداة...
cs: Výměna nástroje...
it: Cambio utensile...
pt: Troca de ferramenta ...
tr: Alet değişimi...
zh_cn: 换刀...

# mainInfoUndo
source: Undo last action
ar: التراجع عن آخر إجراء
cs: Vrátit zpět poslední akci
it: Annulla l'ultima azione
pt: Desfazer a última ação
tr: Son işlemi geri al
zh_cn: 撤消上一个动作

# mainInfoWaitIdle
source: Wait for IDLE, then pause (
ar: انتظر IDLE ، ثم توقف مؤقتًا (
cs: Počkejte na NEČINNOU, poté pauzu (
it: Attendi IDLE, quindi metti in pausa (
pt: Aguarde IDLE e faça uma pausa (
tr: IDLE için bekleyin, ardından duraklatın (
zh_cn: 等待IDLE，然后暂停（

# mainLimits1
source: Next move will exceed machine limits!\r
ar: الخطوة التالية ستتجاوز حدود الماكينة!
cs: Další pohyb překročí limity stroje!\r
it: La prossima mossa supererà i limiti della macchina!\r
pt: O próximo passo excederá os limites da máquina!
tr: Bir sonraki hamle makine sınırlarını aşacak!\r
zh_cn: 下一步将超出机器限制！\r

# mainLimits2
source: \r\n Press 'Ok' to move anyway
ar: \ r \ n اضغط على "موافق" للتحرك على أي حال
cs: \r\n Chcete-li se přesto přesunout, stiskněte 'OK'
it: \r\n Premi 'Ok' per spostarti comunque
pt: \r\n Pressione 'Ok' para mover de qualquer maneira
tr: \r\n Yine de hareket etmek için 'Tamam'a basın
zh_cn: \r\n按“确定”继续移动

# mainLimits3
source: Graphics dimension exceeds machine dimension!\r\nTransformation is recommended to avoid damaging the machine!
ar: يتجاوز حجم الرسومات بعد الماكينة! \ r \ n يوصى بالتحويل لتجنب إتلاف الجهاز!
cs: Rozměr grafiky přesahuje rozměry stroje!\r\nDoporučuje se transformace, aby nedošlo k poškození stroje!
it: La dimensione grafica supera la dimensione della macchina!\r\nSi consiglia la trasformazione per evitare di danneggiare la macchina!
pt: A dimensão gráfica excede a dimensão da máquina! \r\nA transformação é recomendada para evitar danos à máquina!
tr: Grafik boyutu makine boyutunu aşıyor!\r\nMakineye zarar vermemek için dönüştürme önerilir!
zh_cn: 图形尺寸超出了机器尺寸！\r\n建议进行变形以避免损坏机器！

# mainLoadError
source: Streaming must be stopped before loading new file
ar: يجب إيقاف البث قبل تحميل ملف جديد
cs: Před načtením nového souboru musí být streamování zastaveno
it: Lo streaming deve essere interrotto prima di caricare un nuovo file
pt: O fluxo deve ser interrompido antes de carregar o novo arquivo
tr: Yeni dosya yüklenmeden önce akış durdurulmalıdır
zh_cn: 加载新文件之前必须停止流传输

# mainLoadError1
source: File not found: '
ar: لم يتم العثور على الملف: '
cs: Soubor nenalezen: '
it: File non trovato: '
pt: Arquivo não encontrado: '
tr: Dosya bulunamadı: '
zh_cn: 文件未找到： '

# mainLoadError2
source: URL extension is not 'svg' or 'dxf'\r\nTry SVG import anyway, but without setting 'Recent File' list.
ar: امتداد عنوان URL ليس "svg" أو "dxf" \ r \ n حاول استيراد SVG على أي حال ، ولكن دون إعداد قائمة "الملف الأخير".
cs: Přípona URL není 'svg' nebo 'dxf'\r\nPřesto zkuste import SVG, ale bez nastavení seznamu 'Poslední soubor'.
it: L'estensione dell'URL non è 'svg' o 'dxf'\r\nProva comunque con l'importazione SVG, ma senza impostare l'elenco 'File recenti'.
pt: A extensão do URL não é 'svg' ou 'dxf' \r\nTente importar o SVG de qualquer maneira, mas sem definir a lista 'Arquivo recente'.
tr: URL uzantısı 'svg' veya 'dxf' değil\r\nYine de SVG içe aktarmayı deneyin, ancak 'Son Dosya' listesini ayarlamadan.
zh_cn: URL扩展名不是'svg'或'dxf'\r\n无论如何都尝试SVG导入，但未设置“近期文件”列表。

# mainLoadError3
source: File extension not supported '
ar: امتداد الملف غير مدعوم "
cs: Přípona souboru není podporována
it: Estensione file non supportata '
pt: Extensão de arquivo não suportada '
tr: Dosya uzantısı desteklenmiyor'
zh_cn: 不支持文件扩展名

# mainParseError
source: Not a valid number
ar: ليس رقم صحيح
cs: Neplatné číslo
it: Non è un numero valido
pt: Não é um número válido
tr: geçerli bir numara değil
zh_cn: 无效号码

# mainParseError1
source: Not a valid number, set line to 0
ar: ليس رقمًا صالحًا ، قم بتعيين السطر على 0
cs: Neplatné číslo, nastavte řádek na 0
it: Numero non valido, imposta la riga su 0
pt: Não é um número válido, defina a linha como 0
tr: Geçerli bir sayı değil, satırı 0 olarak ayarlayın
zh_cn: 不是有效数字，请将行设置为0

# mainPauseStream
source: Pause streaming - press play
ar: توقف مؤقتًا - اضغط على play
cs: Pozastavit streamování - stiskněte tlačítko Přehrát
it: Metti in pausa lo streaming: premi play
pt: Pausar streaming - pressione reproduzir
tr: Akışı duraklatın - oynat'a basın
zh_cn: 暂停流媒体-按播放

# mainPauseStream1
source: The last job was paused at line
ar: تم إيقاف الوظيفة الأخيرة في الطابور
cs: Poslední úloha byla pozastavena na řádku
it: L'ultimo lavoro è stato sospeso in linea
pt: O último trabalho foi interrompido na linha
tr: Son iş satırda duraklatıldı
zh_cn: 上一条作业在行暂停

# mainPauseStream2
source: Do you want to continue the job?
ar: هل تريد مواصلة العمل؟
cs: Chcete v práci pokračovat?
it: Vuoi continuare il lavoro?
pt: Você quer continuar o trabalho?
tr: İşe devam etmek istiyor musun?
zh_cn: 你想继续这份工作吗？

# mainProblem
source: Problem
ar: مشكلة
cs: Problém
it: Problema
pt: Problema
tr: Sorun
zh_cn: 问题

# mainProgress
source: Progress
ar: تقدم
cs: Pokrok
it: Progresso
pt: Progresso
tr: İlerlemek
zh_cn: 进展

# mainQuit
source: Quit GRBL-Plotter?
ar: استقال GRBL-Plotter؟
cs: Ukončit GRBL-Plotter?
it: Uscire da GRBL-Plotter?
pt: Sair do GRBL-Plotter?
tr: GRBL-Plotter'dan çıkılsın mı?
zh_cn: 退出GRBL-Plotter吗？

# mainSimuSpeed
source: Speed
ar: سرعة
cs: Rychlost
it: Velocità
pt: Rapidez
tr: Hız
zh_cn: 速度

# mainSimuStart
source: Start path simulation
ar: بدء محاكاة المسار
cs: Spusťte simulaci cesty
it: Avvia la simulazione del percorso
pt: Iniciar simulação de caminho
tr: Yol simülasyonunu başlat
zh_cn: 起始路径模拟

# mainSimuStop
source: Stop simulation
ar: وقف المحاكاة
cs: Zastavit simulaci
it: Interrompi la simulazione
pt: Parar simulação
tr: Simülasyonu durdur
zh_cn: 停止模拟

# mainStreamingActive
source: Streaming is still active - press Stop and try again
ar: لا يزال البث نشطًا - اضغط على إيقاف وحاول مرة أخرى
cs: Streamování je stále aktivní – stiskněte Stop a zkuste to znovu
it: Lo streaming è ancora attivo: premi Interrompi e riprova
pt: A transmissão ainda está ativa - pressione Parar e tente novamente
tr: Akış hala etkin - Durdur'a basın ve tekrar deneyin
zh_cn: 流媒体仍处于活动状态-按“停止”，然后重试

# mainToolChange
source: Tool / Pen change!
ar: تغيير أداة / القلم!
cs: Výměna nástroje / pera!
it: Cambio strumento/penna!
pt: Troca de ferramenta / caneta!
tr: Alet / Kalem değişimi!
zh_cn: 工具/笔更换！

# mainToolChange1
source: Tool change needed:\r
ar: يلزم تغيير الأداة: \ r
cs: Nutná výměna nástroje:\r
it: Cambio utensile necessario:\r
pt: Mudança de ferramenta necessária:
tr: Alet değişikliği gerekli:\r
zh_cn: 需要换刀：\r

# mainToolChange2
source: \rpress start to continue.
ar: \ rpress البدء في المتابعة.
cs: \rpro pokračování stiskněte start.
it: \rpremere inizio per continuare.
pt: pressione iniciar para continuar.
tr: \rdevam etmek için başlat'a basın.
zh_cn: \r按开始继续。

# mainUnknownCode
source: Fixed some unknown G-Code:\r\n
ar: تم إصلاح بعض رموز G غير المعروفة: \ r \ n
cs: Opraven nějaký neznámý G-Code:\r\n
it: Risolti alcuni G-Code sconosciuti:\r\n
pt: Corrigido um código G desconhecido: \r\n
tr: Bazı bilinmeyen G-Kodları düzeltildi:\r\n
zh_cn: 未知的G-Code注释掉：\r\n

# probingCancel1
source: Probing canceled
ar: تم إلغاء التحقيق
cs: Sondování zrušeno
it: Sondaggio annullato
pt: Sondagem cancelada
tr: İnceleme iptal edildi
zh_cn: 采样中止

# probingCancel2
source: Process last command
ar: عملية الأمر الأخير
cs: Zpracovat poslední příkaz
it: Elabora ultimo comando
pt: Processar o último comando
tr: Son komutu işle
zh_cn: 处理最后一条命令

# probingCenter
source: Move to center
ar: الانتقال إلى المركز
cs: Přesunout do středu
it: Sposta al centro
pt: Mover para o centro
tr: Merkeze taşı
zh_cn: 移到中心

# probingFail1
source: Fail: no contact
ar: فشل: لا يوجد اتصال
cs: Selhání: žádný kontakt
it: Fallito: nessun contatto
pt: Falhar: sem contato
tr: Başarısız: temas yok
zh_cn: 失败：没有联系

# probingFail2
source: Cancel probing
ar: إلغاء التحقيق
cs: Zrušit sondování
it: Annulla il sondaggio
pt: Cancelar sondagem
tr: Taramayı iptal et
zh_cn: 取消探测

# probingFinish
source: Finish
ar: إنهاء
cs: Dokončit
it: Fine
pt: Terminar
tr: Sona ermek
zh_cn: 完

# probingProbingOn
source: Probing on
ar: التحقيق في
cs: Sondování zapnuto
it: Sondaggio in corso
pt: Sondagem ativada
tr: üzerinde araştırma
zh_cn: 在上探测

# probingSetCenter
source: Set center
ar: تعيين المركز
cs: Nastavte střed
it: Imposta il centro
pt: Definir centro
tr: Merkezi ayarla
zh_cn: 设置中心

# probingTimeOut
source: Time out
ar: نفذ الوقت
cs: Časový limit
it: Tempo scaduto
pt: Tempo esgotado
tr: Zaman aşımı
zh_cn: 暂停

# serialClose
source: Close
ar: قريب
cs: Zavřít
it: Chiudere
pt: Fechar
tr: Kapalı
zh_cn: 关

# serialCloseError
source: Serial Connection is needed.\r\nClose main window instead
ar: هناك حاجة إلى اتصال تسلسلي. \ r \ n أغلق النافذة الرئيسية بدلاً من ذلك
cs: Je nutné sériové připojení.\r\nNamísto toho zavřete hlavní okno
it: È necessaria una connessione seriale.\r\nChiudi invece la finestra principale
pt: É necessário conexão serial. \ R \ nFeche a janela principal
tr: Seri Bağlantı gerekli.\r\nBunun yerine ana pencereyi kapat
zh_cn: 需要串行连接。\r\n关闭主窗口

# serialOpen
source: Open
ar: افتح
cs: Otevřeno
it: Aprire
pt: Abrir
tr: Açık
zh_cn: 打开

# statusStripeCheckCOM
source: Check COM-window for further information
ar: تحقق من نافذة COM للحصول على مزيد من المعلومات
cs: Další informace naleznete v okně COM
it: Controllare la finestra COM per ulteriori informazioni
pt: Verifique a janela COM para obter mais informações
tr: Daha fazla bilgi için COM penceresini kontrol edin
zh_cn: 检查COM窗口以获取更多信息

# statusStripeClickKeys
source: Alt-Click to select Figure; Control-Click to select Group; Shift-Click to select Tile;Or click on XML-Tag
ar: Alt- انقر لتحديد الشكل ؛ انقر لتحديد المجموعة ؛ انقر مع الضغط على مفتاح Shift لتحديد لوحة ؛ أو انقر على علامة XML
cs: Se stisknutou klávesou Alt vyberte Obrázek; Ctrl-Klikněte pro výběr skupiny; Klepnutím se stisknutou klávesou Shift vyberte dlaždici; Nebo klikněte na XML-Tag
it: Alt-Clic per selezionare Figura; Ctrl-clic per selezionare Gruppo; Fai clic tenendo premuto Maiusc per selezionare Affianca; oppure fai clic su Tag XML
pt: Alt-clique para selecionar Figura; Clique com a tecla Control para selecionar o Grupo; Clique com a tecla Shift pressionada para selecionar o Bloco ou clique em Tag XML
tr: Şekil'i seçmek için Alt-Tıklayın; Grup'u seçmek için Control-Tıkla; Döşeme'yi seçmek için Shift-Tıklayın; Veya XML Etiketine tıklayın
zh_cn: Alt单击以选择“地物”；按住Control键并单击以选择“组”；按住Shift键并单击以选择图块；或单击XML-Tag

# statusStripeClickKeys2
source: Click: mark Figure; Control-Click: mark Group; Shift-Click: mark Tile;Alt-Click: show GCode line
ar: انقر فوق: علامة الشكل؛ انقر فوق التحكم: علامة المجموعة ؛ Shift-Click: علامة Tile ؛ Alt-Click: إظهار خط GCode
cs: Klikněte: označte obrázek; Control-Click: označte skupinu; Shift-Click: označit dlaždici;Alt-kliknout: zobrazit řádek GCode
it: Clicca: segna Figura; Control-Clic: segna Gruppo; Maiusc-clic: segna Tile; Alt-clic: mostra la linea GCode
pt: Clique em: marcar Figura; Control-Click: marcar Grupo; Shift-Clique: marcar Bloco; Alt-Clique: mostrar linha GCode
tr: Tıklayın: Şekil'i işaretleyin; Control-Tıkla: Grubu işaretleyin; Shift-Click: Döşemeyi işaretleyin;Alt-Click: GCode satırını göster
zh_cn: 点击：标记图；按住Control键并单击：标记组；按住Shift的同时单击：标记图块；按Alt的同时单击：显示GCode行

# statusStripeDownKeys
source: Control-Down to move selected Block one down; Control-Shift-Down to move to end
ar: Control-Down لتحريك الكتلة المحددة لأسفل ؛ Control-Shift-Down للانتقال إلى النهاية
cs: Control-Down pro posunutí vybraného bloku o jeden dolů; Ctrl-Shift-Dolů pro přesun na konec
it: Control-Giù per spostare il blocco selezionato uno verso il basso; Control-Shift-Giù per andare alla fine
pt: Control-Down para mover o bloco selecionado um para baixo; Control-Shift-Down para mover para o final
tr: Seçilen Bloğu bir aşağı taşımak için Control-Down; Sona gitmek için Control-Shift-Down
zh_cn: Control-Down键将选定的块向下移动一格； 按住Control-Shift-Down移至结尾

# statusStripeEditModeOn
source: Edit mode on - click into 2D view to finish
ar: تحرير الوضع - انقر على عرض ثنائي الأبعاد للإنهاء
cs: Režim úprav zapnut – kliknutím do 2D zobrazení dokončete
it: Modalità di modifica attiva: fai clic nella vista 2D per terminare
pt: Modo de edição ativado - clique na visualização 2D para finalizar
tr: Düzenleme modu açık - bitirmek için 2B görünüme tıklayın
zh_cn: 开启编辑模式-单击进入2D视图以完成

# statusStripeFileLoad
source: File loading
ar: تحميل الملف
cs: Načítání souboru
it: Caricamento file
pt: Carregamento de arquivo
tr: dosya yükleme
zh_cn: 文件加载

# statusStripeFileNotFound
source: File not found - remove from list
ar: لم يتم العثور على الملف - إزالة من القائمة
cs: Soubor nenalezen - odstranit ze seznamu
it: File non trovato - rimuovi dall'elenco
pt: Arquivo não encontrado - remover da lista
tr: Dosya bulunamadı - listeden kaldır
zh_cn: 找不到文件-从列表中删除

# statusStripeGrblResetNeeded
source: Perhaps serial port is locked and a restart of GRBL-Plotter is needed
ar: ربما تم تأمين المنفذ التسلسلي وتحتاج إلى إعادة تشغيل GRBL- راسمة
cs: Možná je sériový port uzamčen a je potřeba restartovat GRBL-Plotter
it: Forse la porta seriale è bloccata ed è necessario riavviare GRBL-Plotter
pt: Talvez a porta serial esteja bloqueada e seja necessário reiniciar o GRBL-Plotter
tr: Belki de seri bağlantı noktası kilitlidir ve GRBL-Plotter'ın yeniden başlatılması gerekiyor
zh_cn: 也许串行端口被锁定，需要重启GRBL-Plotter

# statusStripeResetNeeded
source: Probably a reset of the controller is needed
ar: ربما هناك حاجة لإعادة ضبط وحدة التحكم
cs: Pravděpodobně je potřeba reset ovladače
it: Probabilmente è necessario un reset del controller
pt: Provavelmente é necessário reiniciar o controlador
tr: Muhtemelen denetleyicinin sıfırlanması gerekiyor
zh_cn: 可能需要重置控制器

# statusStripeSelectionMoved
source: Selection moved by
ar: تم نقل التحديد بواسطة
cs: Výběr se přesunul
it: Selezione spostata
pt: Seleção movida por
tr: Seçimi taşıyan
zh_cn: 选择移至

# statusStripeStreamingStatusSaved
source: Streaming status and G-Code are saved in '_lastProcessed.nc'. Continuation after program restart is possible.
ar: يتم حفظ حالة البث و G-Code في "_lastProcessed.nc". يمكن الاستمرار بعد إعادة تشغيل البرنامج.
cs: Stav streamování a G-Code jsou uloženy v '_lastProcessed.nc'. Pokračování po restartu programu je možné.
it: Lo stato dello streaming e il codice G vengono salvati in '_lastProcessed.nc'. È possibile la continuazione dopo il riavvio del programma.
pt: O status da transmissão e o código G são salvos em '_lastProcessed.nc'. É possível continuar após a reinicialização do programa.
tr: Akış durumu ve G-Kodu '_lastProcessed.nc' dosyasına kaydedilir. Program yeniden başlatıldıktan sonra devam etmek mümkündür.
zh_cn: 流状态和G代码保存在“ _lastProcessed.nc”中。 程序重新启动后可以继续。

# statusStripeUpKeys
source: Control-Up to move selected Block one up; Control-Shift-Up to move to top
ar: Control-Up لتحريك الكتلة المحددة لأعلى ؛ Control-Shift-Up للانتقال إلى الأعلى
cs: Control-Up pro přesun vybraného bloku o jeden nahoru; Ctrl-Shift-Up pro přesun nahoru
it: Control-Up per spostare il blocco selezionato in alto; Control-Maiuscole-Su per spostarsi in alto
pt: Control-Up para mover o bloco selecionado para cima; Control-Shift-Up para mover para o topo
tr: Seçilen Bloğu bir yukarı taşımak için Control-Up; En üste gitmek için Control-Shift-Up
zh_cn: Control-Up向上移动选定的块一； Ctrl-Shift-Up移至顶部

# statusStripeCheckUpdate
source: 'Check for new GRBL-Plotter release on GitHub' - can be disabled in [Setup - Program control]
ar: "التحقق من إصدار GRBL-Plotter الجديد على GitHub" - يمكن تعطيله في [الإعداد - التحكم في البرنامج]
cs: 'Zkontrolovat nové vydání GRBL-Plotter na GitHubu' - lze deaktivovat v [Nastavení - Ovládání programu]
it: "Controlla la nuova versione del plotter GRBL su GitHub" - può essere disabilitato in [Installazione - Controllo del programma]
pt: 'Verificar se há nova versão do GRBL-Plotter no GitHub' - pode ser desativado em [Setup - Program control]
tr: 'GitHub'da yeni GRBL-Plotter sürümünü kontrol edin' - [Kurulum - Program kontrolü]'nde devre dışı bırakılabilir
zh_cn: “在GitHub上检查新的GRBL-Plotter版本”-可以在[设置-程序控制]中禁用

# cameraMountFix
source: Fix mounted camera
ar: إصلاح الكاميرا المثبتة
cs: Opravte namontovanou kameru
it: Fissare la telecamera montata
pt: Fixar câmera montada
tr: Monte edilmiş kamerayı sabitleyin
zh_cn: 固定安装的摄像头

# cameraMountXy
source: Camera mounted on XY platform
ar: تم تركيب الكاميرا على منصة XY
cs: Kamera namontovaná na platformě XY
it: Telecamera montata su piattaforma XY
pt: Câmera montada na plataforma XY
tr: XY platformuna monte edilmiş kamera
zh_cn: 安装在 XY 平台上的相机

# cameraMountXyz
source: Camera mounted on Z axis
ar: الكاميرا مُثبَّتة على المحور Z.
cs: Kamera namontovaná na ose Z
it: Telecamera montata sull'asse Z
pt: Câmera montada no eixo Z
tr: Z eksenine monte edilmiş kamera
zh_cn: 安装在 Z 轴上的相机

# cameraSetRadius
source: Set radius
ar: تعيين نصف القطر
cs: Nastavit poloměr
it: Imposta raggio
pt: Definir raio
tr: Yarıçapı ayarla
zh_cn: 设置半径

# cameraScaling
source: scaling
ar: تحجيم
cs: škálování
it: ridimensionamento
pt: Dimensionamento
tr: ölçekleme
zh_cn: 缩放

# cameraTeachRadius
source: Teach circle radius of
ar: حدد دائرة نصف قطرها للتدريس
cs: Naučte poloměr kruhu
it: Insegna raggio cerchio di
pt: Defina o raio do círculo de aprendizagem
tr: daire yarıçapını öğret
zh_cn: 设置示教圆半径

# cameraForUpperPos
source: for upper camera position
ar: لموضع الكاميرا العلوي
cs: pro horní polohu kamery
it: per la posizione superiore della telecamera
pt: para a posição superior da câmera
tr: üst kamera konumu için
zh_cn: 用于上部相机位置

# cameraForLowerPos
source: for lower camera position
ar: لوضع الكاميرا السفلي
cs: pro nižší polohu kamery
it: per la posizione della telecamera più bassa
pt: para a posição mais baixa da câmera
tr: alt kamera konumu için
zh_cn: 用于较低的相机位置

# cameraQuit
source: Press 'ESC' to quit teaching.
ar: اضغط على "ESC" لإنهاء التدريس.
cs: Stisknutím „ESC“ ukončíte učení.
it: Premi 'ESC' per smettere di insegnare.
pt: Pressione 'ESC' para encerrar o ensino.
tr: Öğretimden çıkmak için 'ESC'ye basın.
zh_cn: 按“ESC”结束示教。

# cameraSetMount
source: Set camera mounting to
ar: ضبط تركيب الكاميرا
cs: Nastavte montáž kamery na
it: Impostare il montaggio della telecamera su
pt: Configurando o suporte da câmera
tr: Kamera montajını şu şekilde ayarla:
zh_cn: 设置相机支架
