Repository: krupnfs/GRBL-Plotter
Catalog: GRBL-Plotter/Resources/ResStrings.*.resx
Languages: ar, cs, it, pt, tr, zh_cn

# importMessageLaserModeNok
source: grbl Laser mode $32 is not enabled
ar: لم يتم تنشيط وضع الليزر grbl 32 دولارًا
cs: laserový režim grbl $32 není aktivován
it: La modalità laser grbl $32 non è attivata
pt: grbl laser mode $32 não está ativado
tr: grbl lazer modu $32 aktif değil
zh_cn: grbl 激光模式 $32 未激活

# importMessageLaserPower
source: Laser power
ar: طاقة الليزر
cs: výkon laseru
it: potenza laser
pt: potência do laser
tr: lazer gücü
zh_cn: 激光功率

# importMessageSpindleSpeed
source: Spindle Speed
ar: سرعة المغزل
cs: otáčky vřetena
it: velocità del mandrino
pt: velocidade do fuso
tr: iş mili hızı
zh_cn: 主轴转速

# importMessageSpindleSpeedMax
source: grbl Spindle speed Max.
ar: أقصى سرعة مغزل grbl.
cs: otáčky vřetena grbl max.
it: grbl velocità mandrino max.
pt: grbl velocidade do fuso máx.
tr: grbl iş mili hızı maks.
zh_cn: grbl 主轴最高转速

# importMessagePUD
source: Pen up/down translation:
ar: ترجمة القلم لأعلى / لأسفل:
cs: Překlad perem nahoru/dolů:
it: Traduzione penna su/giù:
pt: Tradução da caneta para cima/para baixo:
tr: Kalem Yukarı/Aşağı Çeviri:
zh_cn: 笔向上/向下翻译：

# importMessagePUDZ
source: Z axis enabled
ar: تنشيط المحور Z
cs: Osa Z aktivována
it: Asse Z abilitato
pt: Eixo Z ativado
tr: Z ekseni etkin
zh_cn: 启用 Z 轴

# importMessagePUDZNoSpindle
source: Spindle will not be switched on
ar: المغزل ليس قيد التشغيل
cs: Vřeteno není zapnuté
it: Il mandrino non è acceso
pt: O fuso não está ligado
tr: Mil açık değil
zh_cn: 主轴未开启

# importMessagePUDZFeed
source: Z Feed
ar: تغذية Z
it: Alimentazione Z
pt: alimentação Z
tr: Z beslemesi
zh_cn: Z进给

# importMessagePUDZUp
source: Z Up (save)
ar: Z Up (ارتفاع آمن)
cs: Z nahoru (bezpečná výška)
it: Z Up (altezza di sicurezza)
pt: Z Up (altura segura)
tr: Z Yukarı (güvenli yükseklik)
zh_cn: Z 向上（安全高度）

# importMessagePUDZDown
source: Z Down (engrave)
ar: Z Down (نقش)
cs: Z Down (rytina)
it: Z Giù (incisione)
pt: Z Abaixo (gravação)
tr: Z Aşağı (gravür)
zh_cn: Z 向下（雕刻）

# importMessagePUDZDepthPass
source: Depth per pass
ar: العمق لكل تمريرة
cs: hloubka na průchod
it: profondità per passata
pt: profundidade por passe
tr: geçiş başına derinlik
zh_cn: 单程深度

# importMessagePUDZDepthPassNoZUp
source: No Z up between passes
ar: لا Z يصل بين التمريرات
cs: Žádné Z nahoru mezi průchody
it: No Z Up tra i passaggi
pt: Sem Z Up entre passes
tr: Geçişler arasında Z Yukarı yok
zh_cn: 两次通过之间没有 Z Up

# importMessagePUDZFeedMax
source: grbl Z Max. Feed rate:
ar: grbl Z max تغذية:
cs: grbl Z max. posuv:
it: grbl Z avanzamento massimo:
pt: grbl Z alimentação máx.:
tr: grbl Z maks. ilerleme:
zh_cn: grbl Z 最大进给：

# importMessagePUDPWM
source: PWM enabled (Servo control)
ar: تمكين PWM (تحكم مؤازر)
cs: PWM povoleno (servořízení)
it: PWM abilitato (servocontrollo)
pt: PWM ativado (controle de servo)
tr: PWM etkin (servo kontrol)
zh_cn: 启用 PWM（伺服控制）

# importMessagePUDPWMUp
source: PWM Up
ar: ارتفاع PWM
cs: PWM vysoká
it: PWM alto
pt: PWM alto
tr: PWM yüksek
zh_cn: 脉宽调制高

# importMessagePUDPWMZero
source: PWM Zero
ar: PWM صفر
cs: PWM nula
it: PWM nullo
tr: PWM sıfır
zh_cn: 脉宽调零

# importMessagePUDPWMDown
source: PWM Down
ar: PWM أدناه
cs: PWM níže
it: PWM sotto
pt: PWM abaixo
tr: aşağıda PWM
zh_cn: 下面的脉宽调制

# importMessagePUDSpindle
source: Spindle on/off with Pen down/up
ar: قم بتشغيل / إيقاف المغزل باستخدام القلم لأسفل / لأعلى
cs: Zapněte/vypněte vřeteno perem dolů/nahoru
it: Accendere/spegnere il mandrino con la penna su/giù
pt: Ligar/desligar o eixo com a caneta para baixo/para cima
tr: Kalem aşağı/yukarı ile iş milini açın/kapatın
zh_cn: 用笔向下/向上打开/关闭主轴

# importMessagePUDIndividual
source: Individual commands
ar: أوامر فردية
cs: Jednotlivé příkazy
it: Comandi individuali
pt: Comandos individuais
tr: Bireysel komutlar
zh_cn: 个别命令

# importMessagePUDPenUp
source: Pen Up
ar: قلم يصل
cs: pero nahoru
it: penna in su
pt: caneta para cima
tr: kaleme almak
zh_cn: 起笔

# importMessagePUDPenDown
source: Pen Down
ar: القلم لأسفل
cs: perem dolů
it: penna giù
pt: caneta para baixo
tr: aşağı kalem
zh_cn: 落笔

# importMessageOption1
source: Path interpretation:
ar: تفسير المسار:
cs: Výklad cesty:
it: Interpretazione del percorso:
pt: Interpretação do caminho:
tr: Yol yorumu:
zh_cn: 路径解读：

# importMessageOptionNodesOnly
source: Nodes only - make dots at given coordinates
ar: العقد فقط - أنشئ نقاطًا عند إحداثيات محددة
cs: Pouze uzly – vytvářejte body na konkrétních souřadnicích
it: Solo nodi: crea punti a coordinate specifiche
pt: Somente nós - crie pontos em coordenadas específicas
tr: Yalnızca düğümler - belirli koordinatlarda noktalar oluşturun
zh_cn: 仅节点 - 在特定坐标处创建点

# importMessageOptionZFromWidth
source: Get Z value from line width (depth)
ar: يكتشف قيمة Z من عرض الخط (العمق).
cs: Zjistí hodnotu Z z šířky čáry (hloubky).
it: Trova il valore Z dalla larghezza della linea (profondità).
pt: Localiza o valor Z da largura da linha (profundidade).
tr: Çizgi genişliğinden (derinliğinden) Z değerini bulur.
zh_cn: 从线宽（深度）中找到 Z 值。

# importMessageOptionSFromWidth
source: Get S value from line width (laser power / spindle speed)
ar: يحدد قيمة S من عرض الخط (قوة الليزر / سرعة المغزل).
cs: Určuje hodnotu S ze šířky čáry (výkon laseru / rychlost vřetena).
it: Determina il valore S dalla larghezza della linea (potenza laser/velocità del mandrino).
pt: Determina o valor S da largura da linha (potência do laser / velocidade do fuso).
tr: Çizgi genişliğinden (lazer gücü / mil hızı) S değerini belirler.
zh_cn: 根据线宽（激光功率/主轴速度）确定 S 值。

# importMessageOptionCircleToDot
source: Convert circle to point
ar: تحويل الدائرة إلى نقطة
cs: Převést kruh na bod
it: Converti cerchio in punto
pt: Converter círculo em ponto
tr: Daireyi noktaya dönüştür
zh_cn: 将圆转换为点

# importMessageOptionCircleRadiusToZ
source: Convert circle-radius to Z value
ar: تحويل نصف قطر الدائرة إلى قيمة z
cs: Převede poloměr kruhu na hodnotu z
it: Converte il raggio del cerchio in valore z
pt: Converte o raio do círculo em valor z
tr: Daire yarıçapını z değerine dönüştürür
zh_cn: 将圆半径转换为 ​​z 值

# importMessageOption2
source: Path modification:
ar: تغيير المسار:
cs: změna cesty:
it: cambio di percorso:
pt: mudança de caminho:
tr: yol değişikliği:
zh_cn: 路径变化：

# importMessageOptionFilter
source: Filter graphic elements (remove objects)
ar: تصفية العناصر الرسومية (إزالة الكائنات)
cs: Filtrovat grafické prvky (odebrat objekty)
it: Filtra elementi grafici (rimuovi oggetti)
pt: Filtrar elementos gráficos (remover objetos)
tr: Grafik öğelerini filtrele (nesneleri kaldır)
zh_cn: 过滤图形元素（移除对象）

# importMessageOptionHatchFill
source: Add Hatch fill
ar: إضافة فتحة التعبئة
cs: Přidejte výplň poklopu
it: Aggiungi riempimento tratteggio
pt: Adicionar preenchimento de hachura
tr: Kapak dolgusu ekle
zh_cn: 添加影线填充

# importMessageOptionClip
source: Crop or tile graphic
ar: رسم المحاصيل أو البلاط
cs: Oříznutí nebo dlaždice grafiky
it: Ritaglia o affianca la grafica
pt: Cortar ou gráfico lado a lado
tr: Grafiği kırpın veya döşeyin
zh_cn: 裁剪或平铺图形

# importMessageOptionTangential
source: Tangential axis
ar: المحور العرضي
cs: tečnou osu
it: asse tangenziale
pt: eixo tangencial
tr: teğet eksen
zh_cn: 切线轴

# importMessageOptionDragTool
source: Adapt path for Drag tool
ar: تخصيص مسار لأداة السحب
cs: Přizpůsobte cestu pro nástroj tažení
it: Personalizza il percorso per lo strumento di trascinamento
pt: Personalize o caminho para a ferramenta de arrastar
tr: Sürükleme aracı için yolu özelleştirin
zh_cn: 自定义拖动工具的路径

# importMessageOptionExtend
source: Extend path (e.g. for laser cutting)
ar: تمديد المسار (على سبيل المثال للقطع بالليزر)
cs: Prodloužit dráhu (např. pro řezání laserem)
it: Estendi percorso (ad es. per il taglio laser)
pt: Estender o caminho (por exemplo, para corte a laser)
tr: Yolu uzat (örn. lazer kesim için)
zh_cn: 延长路径（例如用于激光切割）

# importMessageOptionOutlineDevelop
source: Outline development
ar: انتهاء
cs: dokončení
it: completamento
pt: conclusão
tr: tamamlama
zh_cn: 完成

# importMessageOptionWireBender
source: Wire bender
ar: بندر الأسلاك
cs: ohýbačka drátu
it: piegafilo
pt: dobrador de arame
tr: tel bükücü
zh_cn: 弯线机

# importMessageOption1Link
source: Possible path interpretations
ar: تفسيرات المسار الممكنة
cs: Možné interpretace cest
it: Possibili interpretazioni di percorso
pt: Possíveis interpretações de caminho
tr: Olası yol yorumları
zh_cn: 可能的路径解释

# importMessageOption2Link
source: Possible path modifications
ar: تعديلات المسار الممكنة
cs: Možné úpravy cesty
it: Possibili modifiche al percorso
pt: Possíveis modificações de caminho
tr: Olası yol değişiklikleri
zh_cn: 可能的路径修改

# importMessageSourceMetadata
source: From Metadata
ar: من البيانات الوصفية
cs: Z metadat
it: Dai metadati
pt: De metadados
tr: Meta verilerden
zh_cn: 来自元数据

# importMessageSourceTooltable
source: From tool table
ar: من جدول الأدوات
cs: Ze stolu nástrojů
it: Dalla tabella degli strumenti
pt: Da tabela de ferramentas
tr: Alet tablosundan
zh_cn: 从工具表

# importMessageSpindleDirection
source: Laser mode / Spindle direction
ar: وضع الليزر / اتجاه المغزل
cs: Laserový režim / Směr vřetena
it: Modalità laser / Direzione mandrino
pt: Modo de laser / direção do fuso
tr: Lazer modu / Mil yönü
zh_cn: 激光模式/主轴方向

# importMessageSpindleDirectionM3
source: M3 (CW-clockwise) Constant Laser Power Mode
ar: M3 (CW باتجاه عقارب الساعة) وضع طاقة الليزر الثابت
cs: M3 (CW-ve směru hodinových ručiček) Režim konstantního výkonu laseru
it: M3 (CW-orario) Modalità di potenza laser costante
pt: M3 (sentido horário) Modo de potência laser constante
tr: M3 (saat yönünde) Sabit Lazer Gücü Modu
zh_cn: M3（顺时针）恒定激光功率模式

# importMessageSpindleDirectionM4
source: M4 (CCW-counterclockwise) Dynamic Laser Power Mode
ar: M4 (CCW - عكس اتجاه عقارب الساعة) وضع طاقة الليزر الديناميكي
cs: M4 (CCW-proti směru hodinových ručiček) Dynamický režim výkonu laseru
it: M4 (CCW-antiorario) Modalità di potenza laser dinamica
pt: M4 (CCW-sentido anti-horário) Modo de potência do laser dinâmico
tr: M4 (CCW-saat yönünün tersine) Dinamik Lazer Gücü Modu
zh_cn: M4（CCW-逆时针）动态激光功率模式

# loadMessageContinue
source: Continue last job?
ar: هل تريد متابعة آخر وظيفة؟
cs: Pokračovat v poslední práci?
it: Continuare l'ultimo lavoro?
pt: Continuar último trabalho?
tr: Son işe devam edilsin mi?
zh_cn: 继续上一份工作？

# loadMessageLastProcessed
source: Loading the last processed G-Code
ar: تحميل آخر معالج G-Code
cs: Načítání posledního zpracovaného G-kódu
it: Caricamento dell'ultimo codice G elaborato
pt: Carregando o último G-Code processado
tr: Son işlenen G-Kodu yükleniyor
zh_cn: 加载最后处理的 G 代码

# loadMessageLoad1
source: Loading G-Code
ar: تحميل G-Code
cs: Načítání G-kódu
it: Caricamento codice G
pt: Carregando Código G
tr: G Kodu Yükleniyor
zh_cn: 加载 G 代码

# loadMessageNoImport
source: No import options applied!
ar: لا توجد خيارات استيراد مطبقة!
cs: Nejsou použity žádné možnosti importu!
it: Nessuna opzione di importazione applicata!
pt: Nenhuma opção de importação aplicada!
tr: İçe aktarma seçeneği uygulanmadı!
zh_cn: 没有应用导入选项！

# loadMessageReplaceM34
source: Load G-Code option: Replaces laser mode command M3 by M4
ar: خيار تحميل G-Code: يستبدل أمر وضع الليزر M3 بـ M4
cs: Volba Načíst G-kód: Nahradí příkaz režimu laseru M3 příkazem M4
it: Opzione Carica codice G: sostituisce il comando modalità laser M3 con M4
pt: Carregar opção G-Code: Substitui o comando do modo laser M3 por M4
tr: G Kodu Yükle seçeneği: Lazer modu komutu M3'ü M4 ile değiştirir
zh_cn: 加载 G 代码选项：用 M4 替换激光模式命令 M3

# loadMessageReplaceM43
source: Load G-Code option: Replaces laser mode command M4 by M3
ar: خيار تحميل G-Code: يستبدل أمر وضع الليزر M4 بـ M3
cs: Možnost Načíst G-kód: Nahradí příkaz režimu laseru M4 příkazem M3
it: Opzione Carica codice G: sostituisce il comando modalità laser M4 con M3
pt: Carregar opção G-Code: Substitui o comando do modo laser M4 por M3
tr: G Kodu Yükle seçeneği: Lazer modu komutu M4'ü M3 ile değiştirir
zh_cn: 加载 G 代码选项：用 M3 替换激光模式命令 M4

# loadMessageStreaming
source: Streaming is active, can't load new file.
ar: البث نشط ، لا يمكن تحميل ملف جديد.
cs: Streamování je aktivní, nelze načíst nový soubor.
it: Lo streaming è attivo, non è possibile caricare il nuovo file.
pt: A transmissão está ativa, não é possível carregar o novo arquivo.
tr: Akış etkin, yeni dosya yüklenemiyor.
zh_cn: 流式传输处于活动状态，无法加载新文件。

# loadMessageToolChange
source: Automatic tool change is enabled
ar: تم تمكين تغيير الأداة التلقائي
cs: Je povolena automatická výměna nástroje
it: Il cambio utensile automatico è abilitato
pt: A troca automática de ferramenta está habilitada
tr: Otomatik takım değiştirme etkinleştirildi
zh_cn: 启用自动换刀

# mainStartMissingFiles
source: Missing program files,<br>please check the GRBL-Plotter installation
ar: ملفات البرنامج المفقودة ، <br> يرجى التحقق من تثبيت GRBL-Plotter
cs: Chybí soubory programu,<br>zkontrolujte prosím instalaci plotru GRBL
it: File di programma mancanti,<br>controlla l'installazione di GRBL-Plotter
pt: Arquivos de programa ausentes,<br>verifique a instalação do GRBL-Plotter
tr: Eksik program dosyaları,<br>lütfen GRBL-Plotter kurulumunu kontrol edin
zh_cn: 缺少程序文件，<br>请检查 GRBL-Plotter 安装

# statusStripeSelectionMoveShift
source: press 'Shift' to snap on grid
ar: اضغط على Shift لمحاذاة الشبكة
cs: Stisknutím Shift přichytíte mřížku
it: Premi Maiusc per agganciare la griglia
pt: Pressione Shift para encaixar a grade
tr: Izgarayı tutturmak için Shift tuşuna basın
zh_cn: 按 Shift 键捕捉网格

# statusStripeSelectionResize
source: Resized by
ar: تم تغيير الحجم بواسطة
cs: Velikost změněna podle
it: Ridimensionato da
pt: Redimensionado por
tr: Şuna göre yeniden boyutlandırıldı:
zh_cn: 调整大小

# statusStripeSelectionResizeCtrl
source: press 'Ctrl' to keep ratio
ar: اضغط على Ctrl للحفاظ على النسبة
cs: Pro zachování poměru stiskněte Ctrl
it: Premere Ctrl per mantenere il rapporto
pt: Pressione Ctrl para manter a proporção
tr: Oranı korumak için Ctrl tuşuna basın
zh_cn: 按 Ctrl 键保持比例

# statusStripeSelectionRotate
source: Rotated by
ar: استدار
cs: Otočil
it: Si voltò
pt: Virou-se
tr: Geri Döndü
zh_cn: 转身

# statusStripeSelectionRotateShift
source: press 'Shift' to snap on full degrees
ar: اضغط على Shift لعرض الدرجات الكاملة
cs: Stisknutím Shift zobrazíte celé stupně
it: Premere Maiusc per visualizzare i gradi completi
pt: Pressione Shift para exibir graus completos
tr: Tam dereceleri görüntülemek için Shift tuşuna basın
zh_cn: 按 Shift 键显示完整度数
