Repository: krupnfs/GRBL-Plotter
Catalog: GRBL-Plotter/Resources/ResStrings.*.resx
Languages: ar, cs, it, pt, tr, zh_cn

# cameraSetCrossHairs
source: Click to set cross hairs position
ar: انقر لتعيين موضع التقاطع
cs: Kliknutím nastavíte polohu zaměřovacího kříže
it: Fare clic per impostare la posizione del mirino
pt: Clique para definir a posição da cruz
tr: Artı işareti konumunu ayarlamak için tıklayın
zh_cn: 单击以设置十字准线位置

# cameraSetDistortion
source: Teach four edges of the distorted rectangle (ratio 4:3). Press ESC to abort.
ar: حدد الزوايا الأربع للمستطيل المشوه (نسبة 4: 3). اضغط على ESC للإلغاء.
cs: Naučte čtyři okraje zdeformovaného obdélníku (poměr 4:3). Stiskněte ESC pro přerušení.
it: Insegna quattro bordi del rettangolo distorto (rapporto 4:3). Premere ESC per annullare.
pt: Marque os quatro cantos do retângulo distorcido (proporção 4: 3). Pressione ESC para cancelar.
tr: Bozuk dikdörtgenin dört kenarını öğretin (oran 4:3). İptal etmek için ESC'ye basın.
zh_cn: 标记扭曲矩形的四个角（比例为 4:3）。按 ESC 取消。

# cameraNoCamera
source: No camera source found. Close and open this window after connecting a camera.
ar: لم يتم العثور على مصدر الكاميرا. أغلق هذه النافذة وافتحها بعد توصيل الكاميرا.
cs: Nebyl nalezen žádný zdroj kamery. Po připojení kamery toto okno zavřete a otevřete.
it: Nessuna sorgente della fotocamera trovata. Chiudi e apri questa finestra dopo aver collegato una telecamera.
pt: Nenhuma fonte de câmera encontrada. Feche e abra esta janela após conectar uma câmera.
tr: Kamera kaynağı bulunamadı. Bir kamera bağladıktan sonra bu pencereyi kapatıp açın.
zh_cn: 找不到相机来源。连接相机后关闭并打开此窗口。

# cameraNextClick
source: Next click will teach scaling\r\n of camera view to
ar: مع النقر التالي ، تم تعيين مقياس \ r \ n عرض الكاميرا
cs: Dalším kliknutím se naučíte měnit měřítko\r\n pohledu kamery
it: Il prossimo clic insegnerà il ridimensionamento\r\n della vista della telecamera a
pt: Com o próximo clique, a escala \ r \ n da visão da câmera é definida
tr: Sonraki tıklama, kamera görüntüsünün ölçeklenmesini\r\n öğretecek
zh_cn: 下一次单击设置相机视图的缩放\ r \ n

# cameraDistortionMarker
source: Distortion marker
ar: علامة تشويه
cs: Značka zkreslení
it: Indicatore di distorsione
pt: Marcador de distorção
tr: Bozulma işaretçisi
zh_cn: 失真标记

source: probing
it: sondare
tr: araştırmak

source: scan
it: scansione
tr: taramak

source: height scan
it: scansione dell'altezza
tr: yükseklik taraması

# useCaseInfo
source: A use-case is a presetted setup to adjust settings for a specific machine and/or application.\r\nThe settings of a selected and applied use-case also remain after the import of the graphics.\r\nA use-case needs to be stored in \data\usecases to be accessible.\r\nAlso exported machine-settings and sub-sets of it can be used.
ar: حالة الاستخدام هي إعداد مسبق الضبط لضبط الإعدادات لجهاز و / أو تطبيق معين. \ r \ n تظل إعدادات حالة الاستخدام المحددة والمطبقة بعد استيراد الرسومات. \ r \ n احتياجات حالة الاستخدام ليتم تخزينها في \ بيانات \ حالات مستخدم حتى يمكن الوصول إليها. \ r \ n يمكن أيضًا استخدام إعدادات الجهاز والمجموعات الفرعية المصدرة منها.
cs: Případ užití je přednastavené nastavení pro úpravu nastavení pro konkrétní stroj a/nebo aplikaci.\r\nNastavení vybraného a použitého případu použití také zůstane po importu grafiky.\r\nPotřeby použití ukládat do \data\usecases, aby byly přístupné.\r\nLze použít také exportovaná nastavení stroje a jejich podmnožiny.
it: Un caso d'uso è un'impostazione preimpostata per regolare le impostazioni per una macchina e/o un'applicazione specifica.\r\nLe impostazioni di un caso d'uso selezionato e applicato rimangono anche dopo l'importazione della grafica.\r\nÈ necessario un caso d'uso da archiviare in \data\usecases per essere accessibile.\r\nÈ anche possibile utilizzare le impostazioni della macchina esportate e i suoi sottoinsiemi.
pt: Um caso de uso é uma configuração predefinida para ajustar as configurações de uma máquina e/ou aplicativo específico.\r\nAs configurações de um caso de uso selecionado e aplicado também permanecem após a importação dos gráficos.\r\nUm caso de uso precisa para ser armazenado em \data\usecases para ser acessível.\r\nTambém podem ser usadas configurações de máquina exportadas e subconjuntos dela.
tr: Kullanım senaryosu, belirli bir makine ve/veya uygulama için ayarları yapmak üzere önceden ayarlanmış bir kurulumdur.\r\nSeçilen ve uygulanan kullanım senaryosunun ayarları, grafiklerin içe aktarılmasından sonra da korunur.\r\nBir kullanım senaryosu gerekir erişilebilir olması için \data\usecases içinde saklanmalıdır.\r\nAyrıca dışa aktarılan makine ayarları ve alt kümeleri kullanılabilir.
zh_cn: 用例是一种预设设置，用于调整特定机器和/或应用程序的设置。\r\n所选和应用的用例的设置在图形导入后也保留。\r\n用例需要存储在 \data\usecases 中以便可访问。\r\n还可以使用导出的机器设置及其子集。

# useCaseInfo2
source: Information
ar: معلومة
cs: Informace
it: Informazione
pt: Em formação
tr: Bilgi
zh_cn: 信息

# useCaseHeader1
source: Use current settings (last loaded: '{0}')
ar: استخدام الإعدادات الحالية (آخر تحميل: "{0}")
cs: Použít aktuální nastavení (naposledy načteno: '{0}')
it: Usa le impostazioni correnti (ultimo caricamento: '{0}')
pt: Use as configurações atuais (último carregamento: '{0}')
tr: Mevcut ayarları kullan (son yüklenen: '{0}')
zh_cn: 使用当前设置（上次加载：“{0}”）

# useCaseHeader2
source: Settings from '{0}'
ar: إعدادات من "{0}"
cs: Nastavení z '{0}'
it: Impostazioni da '{0}'
pt: Configurações de '{0}'
tr: '{0}' ayarları
zh_cn: 来自“{0}”的设置

# useCaseItem0
source: ### Current settings ###
ar: ### الاعدادات الحالية ###
cs: ### Aktuální nastavení ###
it: ### Impostazioni attuali ###
pt: ### Configurações atuais ###
tr: ### Şuanki ayarlar ###
zh_cn: ＃＃＃ 当前设置 ＃＃＃

# codeMessage_1_unknowncommand
source: Given command is unknown or not supported, start an issue on github to clarify.
ar: نظرًا لأن الأمر غير معروف أو غير مدعوم ، ابدأ مشكلة على github للتوضيح.
cs: Daný příkaz je neznámý nebo není podporován, začněte problém na githubu, abyste to objasnili.
it: Dato che il comando è sconosciuto o non supportato, avvia un problema su github per chiarire.
pt: O comando dado é desconhecido ou não é suportado, inicie um problema no github para esclarecer.
tr: Verilen komut bilinmiyor veya desteklenmiyor, açıklığa kavuşturmak için github'da bir sorun başlatın.
zh_cn: 给定命令未知或不受支持，请在 github 上启动一个问题以澄清。

# codeMessage_2_highdataamount
source: The amount of single, selectable, figures exceeds the given maximum an would decrease the performance. \r\nAll figures are summarized to one figure.\r\nThe limit can be adjusted in\r\n[Setup - Graphics import - Path import - Grouping and tools - Conversion concerning]
ar: يتجاوز مقدار الأرقام الفردية القابلة للتحديد الحد الأقصى المعطى وسيؤدي إلى انخفاض الأداء. تم تلخيص كافة الأرقام في شكل واحد. \ r \ n يمكن تعديل الحد في \ r \ n [الإعداد - استيراد الرسومات - استيراد المسار - التجميع والأدوات - بخصوص التوافق]
cs: Množství jednotlivých volitelných čísel překračuje dané maximum a snižuje výkon. Všechny obrázky jsou shrnuty do jednoho čísla.\r\nOmezení lze upravit v\r\n[Nastavení - Import grafiky - Import cesty - Seskupení a nástroje - Úloha týkající se]
it: La quantità di singole cifre selezionabili eccede il massimo dato e diminuirebbe la performance. \r\nTutte le cifre sono riassunte in una cifra.\r\nIl limite può essere regolato in\r\n[Setup - Importazione grafica - Importazione percorso - Raggruppamento e strumenti - Concersione relativa]
pt: A quantidade de figuras únicas e selecionáveis ​​excede o máximo dado e diminuiria o desempenho. Todas as figuras estão resumidas em uma figura.\r\nO limite pode ser ajustado em\r\n[Configuração - Importação de gráficos - Importação de caminho - Agrupamento e ferramentas - Concessão relativa]
tr: Tek, seçilebilir, rakamların miktarı verilen maksimum değeri aşar ve performansı düşürür. \r\nTüm rakamlar tek bir rakamda özetlenmiştir.\r\nSınır\r\n[Kurulum - Grafik içe aktarma - Yol içe aktarma - Gruplama ve araçlar - İlgili kaygı] içinde ayarlanabilir.
zh_cn: 单个可选数字的数量超过给定的最大值会降低性能。所有图形汇总为一个图形。\r\n限制可以在\r\n[设置-图形导入-路径导入-分组和工具-关注]中调整

# codeMessage_2_zdoubletang
source: The z-axis is assigned twice: as tangential axis AND as Pen-up/down axis. \r\nThis will cause strange and unpredictable behavior.
ar: يتم تعيين المحور z مرتين: كمحور مماسي وكمحور Pen-up / down. \ r \ n سيؤدي هذا إلى سلوك غريب وغير متوقع.
cs: Osa z je přiřazena dvakrát: jako tangenciální osa A jako osa Pen-up/down. \r\nTo způsobí podivné a nepředvídatelné chování.
it: L'asse z viene assegnato due volte: come asse tangenziale E come asse Pen-su/giù. \r\nCiò causerà un comportamento strano e imprevedibile.
pt: O eixo z é atribuído duas vezes: como eixo tangencial E como eixo Pen-up/down. \r\nIsso causará um comportamento estranho e imprevisível.
tr: Z ekseni iki kez atanır: teğet eksen VE Kalem yukarı/aşağı ekseni olarak. \r\nBu, garip ve öngörülemeyen davranışlara neden olur.
zh_cn: z 轴被分配两次：作为切向轴和作为笔上/下轴。 \r\n这将导致奇怪和不可预知的行为。

# codeMessage_3_spindlestaysoff
source: M3|M4 / M5 command will not be sent! -> Spindle stays off. \r\nCheck option in \r\n[Setup - Graphics import - G-Code generation - Z axis Pen up/down translation] \r\n☐ Do not switch on spindle
ar: M3 | لن يتم إرسال الأمر M4 / M5! -> المغزل يبقى مغلقا. \ r \ n حدد الخيار في \ r \ n [الإعداد - استيراد الرسومات - إنشاء رمز G - ترجمة لأعلى / لأسفل لقلم المحور Z] \ r \ n☐ لا تقم بتشغيل المغزل
cs: Příkaz M3|M4 / M5 nebude odeslán! -> Vřeteno zůstane vypnuté. \r\nZkontrolujte možnost v \r\n[Nastavení - Import grafiky - Generování G-kódu - Překlad pera nahoru/dolů v ose Z] \r\n☐ Nezapínejte vřeteno
it: Il comando M3|M4 / M5 non verrà inviato! -> Il mandrino rimane spento. \r\nControlla l'opzione in \r\n[Impostazione - Importazione grafica - Generazione codice G - Traslazione penna asse Z su/giù] \r\n☐ Non accendere il mandrino
pt: Comando M3|M4 / M5 não será enviado! -> O fuso permanece desligado. \r\nMarque a opção em \r\n[Configuração - Importação de gráficos - Geração de código G - Eixo Z Tradução para cima/baixo da caneta] \r\n☐ Não ligue o fuso
tr: M3|M4 / M5 komutu gönderilmeyecek! -> Mil kapalı kalır. \r\n\r\n[Kurulum - Grafikleri içe aktarma - G-Kodu oluşturma - Z ekseni Kalem yukarı/aşağı çevirisi] içindeki seçeneği kontrol edin \r\n☐ İş milini açmayın
zh_cn: M3|M4 / M5 命令不会发送！ -> 主轴保持关闭。 \r\n检查选项\r\n[设置 - 图形导入 - G-代码生成 - Z 轴笔向上/向下平移] \r\n☐ 不打开主轴

# codeMessage_3_zdoubleaux
source: The z-axis is assigned twice: as auxillary axis AND as Pen-up/down axis. \r\nThis will cause strange and unpredictable behavior.
ar: يتم تعيين المحور z مرتين: كمحور إضافي وكمحور Pen-up / down. \ r \ n سيؤدي هذا إلى سلوك غريب وغير متوقع.
cs: Osa z je přiřazena dvakrát: jako pomocná osa A jako osa Pen-up/down. \r\nTo způsobí podivné a nepředvídatelné chování.
it: L'asse z è assegnato due volte: come asse ausiliario E come asse Pen-su/giù. \r\nCiò causerà un comportamento strano e imprevedibile.
pt: O eixo z é atribuído duas vezes: como eixo auxiliar E como eixo Pen-up/down. \r\nIsso causará um comportamento estranho e imprevisível.
tr: Z ekseni iki kez atanır: yardımcı eksen olarak VE Kalem yukarı/aşağı ekseni olarak. \r\nBu, garip ve öngörülemeyen davranışlara neden olur.
zh_cn: z 轴被分配两次：作为辅助轴和作为笔上/下轴。 \r\n这将导致奇怪和不可预知的行为。

# codeMessage_3_zdoubletang
source: The z-axis is assigned twice: as tangential axis AND as Pen-up/down axis. \r\nThis will cause strange and unpredictable behavior.
ar: يتم تعيين المحور z مرتين: كمحور مماسي وكمحور Pen-up / down. \ r \ n سيؤدي هذا إلى سلوك غريب وغير متوقع.
cs: Osa z je přiřazena dvakrát: jako tangenciální osa A jako osa Pen-up/down. \r\nTo způsobí podivné a nepředvídatelné chování.
it: L'asse z viene assegnato due volte: come asse tangenziale E come asse Pen-su/giù. \r\nCiò causerà un comportamento strano e imprevedibile.
pt: O eixo z é atribuído duas vezes: como eixo tangencial E como eixo Pen-up/down. \r\nIsso causará um comportamento estranho e imprevisível.
tr: Z ekseni iki kez atanır: teğet eksen VE Kalem yukarı/aşağı ekseni olarak. \r\nBu, garip ve öngörülemeyen davranışlara neden olur.
zh_cn: z 轴被分配两次：作为切向轴和作为笔上/下轴。 \r\n这将导致奇怪和不可预知的行为。

# codeMessage_attention
source: Attention
ar: انتباه
cs: Pozornost
it: Attenzione
pt: Atenção
tr: Dikkat
zh_cn: 注意力

# codeMessage_error
source: Error
ar: خطأ
cs: Chyba
it: Errore
pt: Erro
tr: Hata
zh_cn: 错误

# codeMessage_warning
source: Warning
ar: تحذير
cs: Varování
it: Avvertimento
pt: Aviso
tr: Uyarı
zh_cn: 警告

# codeMessage_1202_dontplot
source: Layer is not visible or printing of layer is disabled. Check: https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
ar: الطبقة غير مرئية أو تم تعطيل الطباعة. تحقق من https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
cs: Vrstva není viditelná nebo je tisk zakázán. Zkontrolujte https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
it: Il livello non è visibile o la stampa del livello è disabilitata. Dai un'occhiata:https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
pt: A camada não está visível ou a impressão está desativada. Verifique https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
tr: Katman görünmüyor veya katmanın yazdırılması devre dışı. Kontrol etmek: https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist
zh_cn: 图层不可见或打印被禁用。 检查 https://librecad.readthedocs.io/en/latest/ref/widgets.html#widget-layerlist

# codeMessage_1302_dontplot
source: Layer, path or object is not visible because of visibility attribute.
ar: الطبقة أو المسار أو الكائن غير مرئي بسبب سمة الرؤية.
cs: Vrstva, cesta nebo objekt nejsou viditelné kvůli atributu viditelnosti.
it: Il livello, il percorso o l'oggetto non è visibile a causa dell'attributo di visibilità.
pt: Camada, caminho ou objeto não está visível devido ao atributo de visibilidade.
tr: Görünürlük özelliği nedeniyle katman, yol veya nesne görünmüyor.
zh_cn: 由于可见性属性，图层、路径或对象不可见。

# statusStripeButtonBlocked
source: Custom button is blocked while streaming
ar: تم حظر الزر المخصص أثناء البث
cs: Vlastní tlačítko je při streamování blokováno
it: Il pulsante personalizzato è bloccato durante lo streaming
pt: O botão personalizado está bloqueado durante a transmissão
tr: Akış sırasında özel düğme engellendi
zh_cn: 流式传输时自定义按钮被阻止

# statusStripeStreamingPause
source: Streaming PAUSE
ar: تدفق وقفة
cs: PAUZA streamování
it: PAUSA streaming
pt: Streaming PAUSA
tr: Akış DURAKLATILDI
zh_cn: 流媒体暂停

# statusStripeStreamingContinue
source: Continue streaming
ar: استمر في البث
cs: Pokračujte ve streamování
it: Continua lo streaming
pt: Continuar transmitindo
tr: Akışa devam et
zh_cn: 继续流式传输

# statusStripeStreamingCheck
source: Check G-Code on grbl controller
ar: تحقق من G-Code على وحدة تحكم grbl
cs: Zkontrolujte G-Code na ovladači grbl
it: Controlla il codice G sul controller grbl
pt: Verifique o código G no controlador grbl
tr: G-Code'u grbl denetleyicisinde kontrol edin
zh_cn: 检查 grbl 控制器上的 G 代码

# statusStripeStreamingStop
source: Streaming STOP at line
ar: الجري STOP على الخط
cs: Streamování STOP na lince
it: Streaming STOP alla linea
pt: Streaming STOP na linha
tr: Akış hattında DURDUR
zh_cn: 在线停止流式传输

# statusStripeStreamingStart
source: Streaming START from line
ar: الجري START من الخط
cs: Streamování START z řádku
it: Streaming INIZIA dalla linea
pt: Streaming START da linha
tr: Akış hattından BAŞLAT
zh_cn: 从线路流式传输 START

# statusStripeStreamingFinish
source: Streaming FINISHED after
ar: انتهى البث بعد
cs: Streamování DOKONČENO poté
it: Streaming FINITO dopo
pt: Transmissão CONCLUÍDA após
tr: Akış şu tarihten sonra TAMAMLANDI:
zh_cn: 流式传输完成后

# codeMessage_1102_dontplot
source: Layer, path or object is not visible because of visibility attribute.
ar: الطبقة أو المسار أو الكائن غير مرئي بسبب سمة الرؤية.
cs: Vrstva, cesta nebo objekt nejsou viditelné kvůli atributu viditelnosti.
it: Il livello, il percorso o l'oggetto non è visibile a causa dell'attributo di visibilità.
pt: Camada, caminho ou objeto não está visível devido ao atributo de visibilidade.
zh_cn: 由于可见性属性，图层、路径或对象不可见。

# codeMessage_1103_elementsupport
source: An unsupported SVG-XML element was found. The resulting image may look different than expected. Possible workaround: try to convert object to path.
ar: تم العثور على عنصر SVG-XML غير مدعوم. قد تبدو الصورة الناتجة مختلفة عما هو متوقع. الحل المحتمل: حاول تحويل الكائن إلى مسار.
cs: Byl nalezen nepodporovaný prvek SVG-XML. Výsledný obrázek může vypadat jinak, než se očekávalo. Možné řešení: zkuste převést objekt na cestu.
it: È stato trovato un elemento SVG-XML non supportato. L'immagine risultante potrebbe avere un aspetto diverso dal previsto. Possibile soluzione: provare a convertire l'oggetto in percorso.
pt: Foi encontrado um elemento SVG-XML não suportado. A imagem resultante pode parecer diferente do esperado. Possível solução alternativa: tente converter o objeto em caminho.
tr: Görünürlük özelliği nedeniyle katman, yol veya nesne görünmüyor. Desteklenmeyen bir SVG-XML Desteklenmeyen bir SVG-XML öğesi bulundu. Ortaya çıkan görüntü beklenenden farklı görünebilir. Olası geçici çözüm: nesneyi path.element'e dönüştürmeye çalışın bulundu. Ortaya çıkan görüntü beklenenden farklı görünebilir. Olası geçici çözüm: nesneyi yola dönüştürmeyi deneyin.
zh_cn: 找到了不受支持的 SVG-XML 元素。 生成的图像可能看起来与预期不同。 可能的解决方法：尝试将对象转换为路径。

# codeMessage_1104_elementuk
source: An unknown SVG-XML element was found. The resulting image may look different than expected. Possible workaround: try to convert object to path.
ar: تم العثور على عنصر SVG-XML غير معروف. قد تبدو الصورة الناتجة مختلفة عما هو متوقع. الحل المحتمل: حاول تحويل الكائن إلى مسار.
cs: Byl nalezen neznámý prvek SVG-XML. Výsledný obrázek může vypadat jinak, než se očekávalo. Možné řešení: zkuste převést objekt na cestu.
it: È stato trovato un elemento SVG-XML non supportato. L'immagine risultante potrebbe avere un aspetto diverso dal previsto. Possibile soluzione: provare a convertire l'oggetto in percorso.
pt: Um elemento SVG-XML desconhecido foi encontrado. A imagem resultante pode parecer diferente do esperado. Possível solução alternativa: tente converter o objeto em caminho.
tr: Bilinmeyen bir SVG-XML öğesi bulundu. Ortaya çıkan görüntü beklenenden farklı görünebilir. Olası geçici çözüm: nesneyi yola dönüştürmeyi deneyin.
zh_cn: 发现未知的 SVG-XML 元素。 生成的图像可能看起来与预期不同。 可能的解决方法：尝试将对象转换为路径。

# codeMessage_1105_textpath
source: An 'tspan' element within a 'textPath' element was found. This combination is not supported. The resulting image may look different than expected. Possible workaround: try to convert object to path.
ar: تم العثور على عنصر "tspan" داخل عنصر "textPath". لا يتم اعتماد هذا الجمع. قد تبدو الصورة الناتجة مختلفة عما هو متوقع. الحل المحتمل: حاول تحويل الكائن إلى مسار.
cs: Byl nalezen prvek 'tspan' v prvku 'textPath'. Tato kombinace není podporována. Výsledný obrázek může vypadat jinak, než se očekávalo. Možné řešení: zkuste převést objekt na cestu.
it: È stato trovato un elemento 'tspan' all'interno di un elemento 'textPath'. Questa combinazione non è supportata.
pt: Um elemento 'tspan' dentro de um elemento 'textPath' foi encontrado. Esta combinação não é suportada. A imagem resultante pode parecer diferente do esperado. Possível solução alternativa: tente converter o objeto em caminho.
tr: Bir 'textPath' öğesi içinde bir 'tspan' öğesi bulundu. Bu kombinasyon desteklenmiyor. Ortaya çıkan görüntü beklenenden farklı görünebilir. Olası geçici çözüm: nesneyi yola dönüştürmeyi deneyin.
zh_cn: 在“textPath”元素中找到了一个“tspan”元素。不支持此组合。 生成的图像可能看起来与预期不同。 可能的解决方法：尝试将对象转换为路径。

# codeMessage_1106_attributesupport
source: An unsupported SVG-XML attribute was found. The resulting image may look different than expected. Possible workaround: try to convert object to path.
ar: تم العثور على سمة SVG-XML غير مدعومة. قد تبدو الصورة الناتجة مختلفة عما هو متوقع. الحل المحتمل: حاول تحويل الكائن إلى مسار.
cs: Byl nalezen nepodporovaný atribut SVG-XML. Výsledný obrázek může vypadat jinak, než se očekávalo. Možné řešení: zkuste převést objekt na cestu.
it: È stato trovato un elemento 'tspan' all'interno di un elemento 'textPath'. Questa combinazione non è supportata.
pt: Foi encontrado um atributo SVG-XML não suportado. A imagem resultante pode parecer diferente do esperado. Possível solução alternativa: tente converter o objeto em caminho.
tr: Desteklenmeyen bir SVG-XML özelliği bulundu. Ortaya çıkan görüntü beklenenden farklı görünebilir. Olası geçici çözüm: nesneyi yola dönüştürmeyi deneyin.
zh_cn: 找到了不受支持的 SVG-XML 属性。 生成的图像可能看起来与预期不同。 可能的解决方法：尝试将对象转换为路径。

# importMessageTitle
source: Import information
ar: معلومات الاستيراد
cs: importovat informace
it: importare informazioni
pt: informações de importação
tr: ithalat bilgileri
zh_cn: 进口信息

# importMessageFileName
source: File name:
ar: اسم الملف:
cs: Název souboru:
it: Nome del file:
pt: Nome do arquivo:
tr: Dosya adı:
zh_cn: 文件名：

# importMessageFilePath
source: File path:
ar: مسار الملف:
cs: Cesta k souboru:
it: Percorso del file:
pt: Caminho de arquivo:
tr: Dosya yolu:
zh_cn: 文件路径：

# importMessageSVGMetaDataOk
source: SVG Metadata processed
ar: معالجة بيانات SVG الوصفية
cs: Zpracována metadata SVG
it: Metadati SVG elaborati
pt: Metadados SVG processados
tr: İşlenen SVG meta verileri
zh_cn: 已处理 SVG 元数据

# importMessageSVGMetaDataNok1
source: SVG Metadata available, but not enabled!
ar: تتوفر بيانات SVG الوصفية ولكنها غير ممكّنة!
cs: Metadata SVG jsou k dispozici, ale nejsou povolena!
it: Metadati SVG disponibili ma non abilitati!
pt: Metadados SVG disponíveis, mas não ativados!
tr: SVG meta verileri mevcut ancak etkin değil!
zh_cn: SVG 元数据可用但未启用！

# importMessageRelMovement
source: Relative movements are enabled
ar: تنشيط الحركات النسبية (يمكن أن يؤدي إلى مشاكل)
cs: Aktivované relativní pohyby (může vést k problémům)
it: Movimenti relativi attivati ​​(possono causare problemi)
pt: Movimentos relativos ativados (podem causar problemas)
tr: Bağıl hareketler etkinleştirildi (sorunlara yol açabilir)
zh_cn: 相对运动被激活（可能导致问题）

# importMessageAddGraphic
source: Add imported graphic
ar: أضف الرسم الذي تم استيراده
cs: Přidat importovanou grafiku
it: Aggiungi grafica importata
pt: Adicionar gráfico importado
tr: İçe aktarılan grafiği ekle
zh_cn: 添加导入的图形

# importMessageToolTableNeeded
source: Tool table needed, last loaded:
ar: مطلوب جدول الأدوات ، آخر تحميل:
cs: Vyžadovat tabulku nástrojů, naposledy načtená:
it: Richiedi tabella utensili, ultimo caricamento:
pt: Requer tabela de ferramentas, carregada por último:
tr: Alet tablosu gerektir, son yüklenen:
zh_cn: 需要工具表，最后加载：

# importMessageGeneralSettings
source: General settings:
ar: الاعدادات العامة:
cs: Obecné nastavení:
it: Impostazioni generali:
pt: Configurações Gerais:
tr: Genel Ayarlar:
zh_cn: 常规设置：

# importMessageXYFeed
source: XY Feed
ar: تغذية XY
cs: Krmivo XY
it: Alimentazione XY
pt: alimentação XY
tr: XY beslemesi
zh_cn: XY进给

# importMessageMaxXYFeed
source: grbl X/Y Max. rate:
ar: تغذية grbl X / Y كحد أقصى:
cs: max. posuv grbl X/Y:
it: grbl Avanzamento massimo X/Y:
pt: grbl X/Y alimentação máx.:
tr: grbl X/Y maks. ilerleme:
zh_cn: grbl X/Y 最大进给：

# importMessageGcodeHeader
source: GCode Header
ar: رأس GCode
cs: Záhlaví GCode
it: Intestazione GCode
pt: Cabeçalho GCode
tr: GCode başlığı
zh_cn: G代码头

# importMessageGcodeFooter
source: GCode Footer
ar: تذييل GCode
cs: Zápatí GCode
it: Piè di pagina GCode
pt: Rodapé GCode
tr: GCode altbilgisi
zh_cn: G代码页脚

# importMessageLaserMode
source: Lasermode: use M3S0 instead of M5 to switch off laser (or spindle)
ar: وضع الليزر: استخدم M3S0 بدلاً من M5 لإيقاف تشغيل الليزر (أو المغزل)
cs: Laserový režim: pro vypnutí laseru (nebo vřetena) použijte M3S0 místo M5
it: Modalità laser: usa M3S0 invece di M5 per spegnere il laser (o il mandrino)
pt: Modo laser: use M3S0 em vez de M5 para desligar o laser (ou eixo)
tr: Lazer modu: lazeri (veya iş milini) kapatmak için M5 yerine M3S0 kullanın
zh_cn: 激光模式：使用 M3S0 代替 M5 关闭激光（或主轴）
